# TP2 Part2 : C'est mieux avec internet

### 1. AccÃ¨s internet routeur
A rÃ©aliser sur le routeur Cisco r1.tp2.efrei.

âžœ Configurer une adresse IP sur l'interface qui pointe vers le nuage GNS3

il faut rÃ©cupÃ©rer une adresse IP en DHCP
vÃ©rifier que vous avez bien rÃ©cupÃ©rÃ© une adresse IP avec un show ip int br en mode enable
ðŸŒž Prouver que...

```
PC1> ping 1.1.1.1
1.1.1.1 icmp_seq=1 timeout
1.1.1.1 icmp_seq=2 timeout
1.1.1.1 icmp_seq=3 timeout
1.1.1.1 icmp_seq=4 timeout
1.1.1.1 icmp_seq=5 timeout
```
âžœ Wireshark this

lancer Wireshark sur le cÃ¢ble entre r1.tp2.efrei et le nuage GNS
capturer un ping de node1 vers 1.1.1.1
vous devriez le voir passer, mais jamais de rÃ©ponse
si vous voulez capter ce qu'il se passe :

regardez l'adresse IP source du paquet ping
vous devriez voir l'adresse IP de node1
ðŸ“ p1_no_nat.pcap

### 2. AccÃ¨s internet clients
âžœ Configurer un NAT simpliste sur votre routeur

rÃ©fÃ©rez-vous toujours au mÃ©mo Cisco pour Ã§a
l'interface "externe" (outside) est celle qui pointe vers internet (le nuage GNS)
les interfaces "internes" (inside) sont celle qui pointent vers les LANs
ðŸŒž Proooooooooof or lie

```
PC1> ping 1.1.1.1
84 bytes from 1.1.1.1 icmp_seq=1 ttl=253 time=65.353 ms
84 bytes from 1.1.1.1 icmp_seq=2 ttl=253 time=26.833 ms
84 bytes from 1.1.1.1 icmp_seq=3 ttl=253 time=25.785 ms
84 bytes from 1.1.1.1 icmp_seq=4 ttl=253 time=44.414 ms
84 bytes from 1.1.1.1 icmp_seq=5 ttl=253 time=33.990 ms
```

```
PC2> ping 1.1.1.1
84 bytes from 1.1.1.1 icmp_seq=1 ttl=253 time=71.069 ms
84 bytes from 1.1.1.1 icmp_seq=2 ttl=253 time=33.227 ms
84 bytes from 1.1.1.1 icmp_seq=3 ttl=253 time=26.089 ms
84 bytes from 1.1.1.1 icmp_seq=4 ttl=253 time=23.254 ms
84 bytes from 1.1.1.1 icmp_seq=5 ttl=253 time=31.590 ms
```
âžœ Wireshark this

lancer Wireshark sur le cÃ¢ble entre r1.tp2.efrei et le nuage GNS
capturer un ping de node1 vers 1.1.1.1
vous devriez le voir passer, avec une rÃ©ponse cette fois
si vous voulez capter ce qu'il se passe :

regardez l'adresse IP source du paquet ping
vous devriez voir l'adresse IP de r1 : r1 a modifiÃ© le paquet pour mettre sa propre IP : c'est le NAT en action
ðŸ“ p1_nat.pcap

âžœ Gimme the config !

c'Ã©tait la derniÃ¨re conf routeur pour ce TP
je veux la running-config dans le compte-rendu
ðŸ“ r1_running_config.txt

contient toute la running-config de r1

### 3. Vrai accÃ¨s internet clients

ðŸŒž Prove it

```
PC1> ip dns 1.1.1.1

PC1> ping efrei.fr
efrei.fr resolved to 51.210.229.203
84 bytes from 51.210.229.203 icmp_seq=1 ttl=253 time=61.881 ms
84 bytes from 51.210.229.203 icmp_seq=2 ttl=253 time=28.919 ms
```

### 4. DHCP again

ðŸŒž Test test test : ajouter un nouveau VPCS au LAN1, le bro node5.tp2.efrei
```
PC5> ip dhcp
DDORA IP 10.2.1.164/24 GW 10.2.1.254

PC5> show

NAME   IP/MASK              GATEWAY           MAC                LPORT  RHOST:PORT
PC5    10.2.1.164/24        10.2.1.254        00:50:79:66:68:04  10014  127.0.0.1:10015
       fe80::250:79ff:fe66:6804/64

PC5>
PC5> ping efrei.fr
efrei.fr resolved to 51.210.229.203
84 bytes from 51.210.229.203 icmp_seq=1 ttl=253 time=43.092 ms
84 bytes from 51.210.229.203 icmp_seq=3 ttl=253 time=110.143 ms
84 bytes from 51.210.229.203 icmp_seq=4 ttl=253 time=126.032 ms
84 bytes from 51.210.229.203 icmp_seq=5 ttl=253 time=130.935 ms
```